[
  {
    "id": 1,
    "title": "Сайт BURGERS",
    "techs": "HTML, SCSS, JavaScript, jQuery, Gulp, HTML Api",
    "photo": "slider-1.jpg",
    "link": "https://spatiume.github.io/burgers/",
    "description": "Проект представляет собой SPA «Burgers». Создавался по макету и соответствующему техническому заданию. Верстка адаптивная и резиновая между брекпоинтами, выполнена на HTML и SCSS. Реализован OnePageScroll с помощью JavaScript. Остальной функционал был реализован с помощью jQuery (слайдер, модальные окна и т.п.). Были реализованы: видеоплеер средствами YouTube Iframe API и Yandex Карты, - и их стилизация согласно макету. "
  },
  {
    "id": 2,
    "title": "Сайт PORTFOLIO (публичная часть)",
    "techs": "Pug, SCSS, Vue, Axios, Webpack",
    "photo": "slider-2.jpg",
    "link": "//yandex.ru",
    "description": "Верстка была сделана на Pug(Jade) и SCSS. Секции выравнивались по Perfect Pixel. Верстка адаптивная, между брекпоинтами сохраняется «резиновое» поведение. Часть секций были созданы с помощью компонентов на Vue. Для получения данных с сервера использовал Axios. На главной секции был использован эффект параллакса. "
  },
  {
    "id": 3,
    "title": "Сайт PORTFOLIO (админ-панель)",
    "techs": "Vue, Vuex, Vue-router, Pug, PostCSS, Axios",
    "photo": "slide4.jpg",
    "link": "//yandex.ru",
    "description": "Админ панель для взаимодействия с данными пользователя. Реализована на Vue. Навигация – Vue-router. Запросы на сервер через Axios. Работа с данными во Vuex. Были реализованы: защита роутов, валидация, обработка запросов, обновление токена, обработка ошибок, авторизация, добавление компонентов в Storybook и др."
  },
  {
    "id": 3,
    "title": "Future project",
    "techs": "HTML, CSS, JavaScript",
    "photo": "slider-3.jpg",
    "link": "//rambler.ru",
    "description": "Здесь будут мои будущие проекты. Здесь будут мои будущие проекты. Здесь будут мои будущие проекты. Здесь будут мои будущие проекты.Здесь будут мои будущие проекты."
  }
]
